src/Documents/ОтчетКомиссионера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ОтчетКомиссионера</Name>
			<Comment>Отчет комиссионера</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыКомпании</xr:Item>
				<xr:Item>InformationRegister.ДопроведениеПоПартиям</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОтданные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Комиссионер, отчитывающийся за проданный товар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор, по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен комиссионной отгрузки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДокНомер</Name>
					<Comment>Номер входящего документа комиссионера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДокДата</Name>
					<Comment>Дата входящего документа комиссионера</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВознаграждения</Name>
					<Comment>Итоговая сумма комиссионного вознаграждения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Товары и услуги</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вознаграждение</Name>
							<Comment>Сумма комиссионного вознаграждения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПередачи</Name>
							<Comment>Документ передачи товара на комиссию</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТД</Name>
							<Comment>Номер грузовой таможенной декларации (для товаров поступивших по импорту)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоЗакрытиеСделок</Name>
							<Comment>Если флажок установлен, то при проведении документа сначала будут оплачены все незакрытые сделки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вознаграждение</Name>
							<Comment>Сумма комиссионного вознаграждения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Comment>Документ фиксации факта продажи товара</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТД</Name>
							<Comment>Номер грузовой таможенной декларации (для товаров поступивших по импорту)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Покупатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПокупателиВозвраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ДопроведениеПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДопроведениеПоПартиям</Name>
			<Comment>Список документов которые необходимо допровести по партиям</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ОтчетКомиссионера/Ext/ObjectModule.bsl
// Модуль документа "Отчет комиссионера"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Реализация товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_РеализацияТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация=Справочники.ХозОперации.РеализацияТоваровКомиссия
		ИЛИ ДанныеЗаполнения.ХозОперация=Справочники.ХозОперации.ВводОстатковТоваровПереданныхНаКомиссию Тогда
		
		Для Каждого СтрокаТЧ Из Товары Цикл
			СтрокаТЧ.ДокументПередачи = ДанныеЗаполнения;
			Документы.ОтчетКомиссионера.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, СтрокаТЧ,ДополнительныеСвойства.ПараметрыДействия);
		КонецЦикла;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_РеализацияТоваров()

// Производит заполнение объекта на основании документа "Ввод остатков товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВводОстатковТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Возвращаем заполнение по реализации
	Возврат ОбработкаЗаполнения_РеализацияТоваров(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецФункции // ОбработкаЗаполнения_ВводОстатковТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СУММА(ОтчетКомиссионераТовары.СуммаВсего) КАК СуммаВсего,
	                    |	СУММА(ОтчетКомиссионераТовары.Вознаграждение) КАК Вознаграждение
	                    |ПОМЕСТИТЬ ДокТовары
	                    |ИЗ
	                    |	Документ.ОтчетКомиссионера.Товары КАК ОтчетКомиссионераТовары
	                    |ГДЕ
	                    |	ОтчетКомиссионераТовары.Ссылка = &Ссылка
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	Док.Ссылка КАК Ссылка,
	                    |	Док.Дата КАК Дата,
	                    |	Док.ВалютаДокумента КАК ВалютаДокумента,
	                    |	Док.КурсДокумента КАК КурсДокумента,
	                    |	Док.ТипЦен КАК ТипЦен,
	                    |	Док.ХозОперация КАК ХозОперация,
	                    |	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	                    |	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	                    |	Док.МоментВремени КАК МоментВремени,
	                    |	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                    |	Док.Проект КАК Проект,
	                    |	Док.СуммаДокумента КАК СуммаДокумента,
	                    |	Док.Ссылка КАК ДокументПродажи,
	                    |	Док.Контрагент КАК Контрагент,
	                    |	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                    |	ЕСТЬNULL(ДокТовары.СуммаВсего, 0) КАК СуммаВсего,
	                    |	ЕСТЬNULL(ДокТовары.Вознаграждение, 0) КАК Вознаграждение
	                    |ИЗ
	                    |	Документ.ОтчетКомиссионера КАК Док
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ДокТовары КАК ДокТовары
	                    |		ПО (ИСТИНА)
	                    |ГДЕ
	                    |	Док.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// возвращает выборку по товарной части
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по товарной части.
//
Функция ПолучитьТоварнуюЧастьДокумента(ДокументСсылка)
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	/////////// ПРИВАТ ////////////
	|	ДокТовары.ДокументПередачи КАК ДокументПередачи,
	|	ДокТовары.ГТД КАК ГТД,
	|	ЕСТЬNULL(ДокТовары.СуммаВсего,0) КАК СуммаВсего,
	|	ЕСТЬNULL(ДокТовары.Вознаграждение,0) КАК Вознаграждение
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+".Товары Как ДокТовары
	|ГДЕ
	|	ДокТовары.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям.
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так.
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ = Ложь;
	
	// получим шапку документа
	ШапкаДокумента = ПолучитьШапкуДокумента(ДокументСсылка);
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
		
	// получим товарную часть документа
	ТоварнаяЧасть = ПолучитьТоварнуюЧастьДокумента(ДокументСсылка);
	
	// Проверим, если подразделение проводится по партиям "отложенно", то дальше не идем.
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Ложь;
		НаборЗаписейДоходыИРасходы.Доход                  = ШапкаДокумента.СуммаВсего-ШапкаДокумента.Вознаграждение;
		НаборЗаписейДоходыИРасходы.Приход();
		Возврат НЕ Отказ;
	КонецЕсли;
	
	ЗапросВозвраты = Новый Запрос("
	|ВЫБРАТЬ
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ГТД,
	|	СУММА(Количество * Коэффициент) КАК Количество,
	|	СУММА(СуммаВсего) КАК СуммаВсего
	|ИЗ
	|	Документ.ОтчетКомиссионера.Возвраты КАК Возвраты
	|ГДЕ
	|	Ссылка=&Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ДокументПродажи,
	|	ГТД");
	ЗапросВозвраты.УстановитьПараметр("Ссылка", ШапкаДокумента.Ссылка);
	ТаблицаВозвратов = ЗапросВозвраты.Выполнить().Выгрузить();
	
	//возвраты(сторно)
	Если ТаблицаВозвратов.Количество()>0 Тогда
		НаборЗаписейПартииОтданные = Движения.ПартииТоваровОтданные;
		НаборЗаписейПартииОтданные.ДокументОбъект				= ЭтотОбъект;
		НаборЗаписейПартииОтданные.Контрагент					= ШапкаДокумента.Контрагент;
		НаборЗаписейПартииОтданные.ДоговорВзаиморасчетов		= ШапкаДокумента.ДоговорВзаиморасчетов;
		НаборЗаписейПартииОтданные.ОтчетКомиссионера			= Истина;
		НаборЗаписейПартииОтданные.РезультатЗапросаПоТоварам	= ТаблицаВозвратов;
		НаборЗаписейПартииОтданные.ШапкаДокумента				= ШапкаДокумента;
		Отказ = НЕ НаборЗаписейПартииОтданные.ОтменаПродажи() ИЛИ Отказ; 
		
		Если НЕ Отказ Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	ВЫБОР КОГДА ДокументПродажи=ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка) ТОГДА Ссылка ИНАЧЕ ДокументПродажи КОНЕЦ ДокументПродажи,
			|	Номенклатура КАК Номенклатура,
			|	ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(Количество * Коэффициент) КАК Количество,
			|	СУММА(СуммаНДС) КАК СуммаНДС,
			|	0 КАК СуммаСкидки,
			|	СУММА(СуммаВсего) КАК Сумма
			|ИЗ
			|	Документ.ОтчетКомиссионера.Возвраты
			|ГДЕ
			|	Ссылка = &Ссылка
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР КОГДА ДокументПродажи=ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка) ТОГДА Ссылка ИНАЧЕ ДокументПродажи КОНЕЦ,
			|	Номенклатура,
			|	ХарактеристикаНоменклатуры,
			|	СтавкаНДС");
			Запрос.УстановитьПараметр("Ссылка",     ШапкаДокумента.Ссылка);
			
			НаборЗаписейПродажи = Движения.Продажи;
			НаборЗаписейПродажи.РежимПроведения				= Режим;
			НаборЗаписейПродажи.ДокументОбъект				= ЭтотОбъект;
			НаборЗаписейПродажи.СкладКомпании				= Справочники.СкладыКомпании.ПустаяСсылка();
			НаборЗаписейПродажи.ДокументПродажи				= Неопределено;
			НаборЗаписейПродажи.Сторно						= Истина;
			НаборЗаписейПродажи.ХозОперация					= Справочники.ХозОперации.ОтчетКомиссионераВозврат;
			НаборЗаписейПродажи.Покупатель					= ШапкаДокумента.Контрагент;
			НаборЗаписейПродажи.ДоговорВзаиморасчетов		= ШапкаДокумента.ДоговорВзаиморасчетов;
			НаборЗаписейПродажи.ПодразделениеКомпании		= ШапкаДокумента.ПодразделениеКомпании;
			НаборЗаписейПродажи.Комиссия					= Истина;
			НаборЗаписейПродажи.ШапкаДокумента				= ШапкаДокумента;
			НаборЗаписейПродажи.РезультатЗапросаПоТоварам	= Запрос.Выполнить().Выгрузить();
			НаборЗаписейПродажи.РезультатЗапросаПоПартиям	= НаборЗаписейПартииОтданные.Выгрузить();
			Отказ = НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		НаборЗаписейПартииОтданные = Движения.ПартииТоваровОтданные;
		НаборЗаписейПартииОтданные.ДокументОбъект			= ЭтотОбъект;
		НаборЗаписейПартииОтданные.Контрагент				= ШапкаДокумента.Контрагент;
		НаборЗаписейПартииОтданные.ДоговорВзаиморасчетов	= ШапкаДокумента.ДоговорВзаиморасчетов;
		НаборЗаписейПартииОтданные.ОтчетКомиссионера		= Истина;
		НаборЗаписейПартииОтданные.ШапкаДокумента			= ШапкаДокумента;
		Отказ = НЕ НаборЗаписейПартииОтданные.Расход() ИЛИ Отказ; 
	КонецЕсли;
	
	// продажи
	Если НЕ Отказ Тогда
		//удалим строки возврата
		ТаблицаПартий = НаборЗаписейПартииОтданные.Выгрузить();
		СтруктураОтбора = Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход);
		МассивНайденныхПартий = ТаблицаПартий.НайтиСтроки(СтруктураОтбора);
		Для Каждого ТекСтрока Из МассивНайденныхПартий Цикл
			Если ТекСтрока.Количество<0 Тогда
				ТаблицаПартий.Удалить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписейПродажи = Движения.Продажи;
		НаборЗаписейПродажи.РежимПроведения				= Режим;
		НаборЗаписейПродажи.ДокументОбъект				= ЭтотОбъект;
		НаборЗаписейПродажи.СкладКомпании				= Справочники.СкладыКомпании.ПустаяСсылка();
		НаборЗаписейПродажи.ДокументПродажи				= ШапкаДокумента.ДокументПродажи;
		НаборЗаписейПродажи.Сторно						= Ложь;
		НаборЗаписейПродажи.Покупатель					= ШапкаДокумента.Контрагент;
		НаборЗаписейПродажи.ДоговорВзаиморасчетов		= ШапкаДокумента.ДоговорВзаиморасчетов;
		НаборЗаписейПродажи.ПодразделениеКомпании		= ШапкаДокумента.ПодразделениеКомпании;
		НаборЗаписейПродажи.Комиссия					= Истина;
		НаборЗаписейПродажи.ШапкаДокумента				= ШапкаДокумента;
		НаборЗаписейПродажи.РезультатЗапросаПоПартиям	= ТаблицаПартий;
		Отказ = НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;
	КонецЕсли;

	// Доходы и расходы
	// сумма себестоимости списанных товаров.
	НаборЗаписейПартииОтданные = Движения.ПартииТоваровОтданные;
	СебестоимостьУпр = НаборЗаписейПартииОтданные.Итог("СуммаСебестоимостиУпр");
	НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
	НаборЗаписейДоходыИРасходы.Подразделение			= ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
	НаборЗаписейДоходыИРасходы.ДокументОбъект			= ЭтотОбъект;
	НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.Себестоимость;
	НаборЗаписейДоходыИРасходы.ВУпрВалюте				= Истина;
	НаборЗаписейДоходыИРасходы.Расход					= СебестоимостьУпр;	
	НаборЗаписейДоходыИРасходы.ШапкаДокумента			= ШапкаДокумента;
	Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	
	// Определим суммы по подразделениям
	// подготовим таблицу для накопления сумм по подразделениям.
	ТаблицаСуммПоПодразделениям = Новый ТаблицаЗначений();
	ТаблицаСуммПоПодразделениям.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	
	ТаблицаСуммПоПодразделениям.Колонки.Добавить("СуммаВсего",     Новый ОписаниеТипов("Число"));
	ТаблицаСуммПоПодразделениям.Колонки.Добавить("Вознаграждение", Новый ОписаниеТипов("Число"));
	Пока ТоварнаяЧасть.Следующий() Цикл
		СтрокаСумм = ТаблицаСуммПоПодразделениям.Добавить();
		Если БалансВедетсяПоПодразделениям Тогда
			СтрокаСумм.Подразделение  = ТоварнаяЧасть.ДокументПередачи.ДоговорВзаиморасчетов.ПодразделениеКомпании;
		Иначе
			СтрокаСумм.Подразделение  = ШапкаДокумента.ПодразделениеКомпании;
		КонецЕсли;
		СтрокаСумм.СуммаВсего     = ТоварнаяЧасть.СуммаВсего;
		СтрокаСумм.Вознаграждение = ТоварнаяЧасть.Вознаграждение;
	КонецЦикла;
	
	ТаблицаСуммПоПодразделениям.Свернуть("Подразделение","СуммаВсего,Вознаграждение");
	
	Для Каждого СтрокаСумм Из ТаблицаСуммПоПодразделениям Цикл
		// Сумма комиссионного вознаграждения
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.Подразделение          = СтрокаСумм.Подразделение;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Вознаграждение;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
		НаборЗаписейДоходыИРасходы.Расход                 = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СтрокаСумм.Вознаграждение,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),?(НЕ ЗначениеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр));
		Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		
		// СуммаВсего - списанная сумма товарной задолженности
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.Подразделение		  = СтрокаСумм.Подразделение;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте			  = Истина;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоТовару;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
		НаборЗаписейДоходыИРасходы.Доход                  = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СтрокаСумм.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),?(НЕ ЗначениеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр));
		Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЦикла;
	
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// посчитаем вознаграждение
	Для Каждого СтрокаТЧ Из Товары Цикл
		Документы.ОтчетКомиссионера.УстановитьВознаграждение(ЭтотОбъект, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
		
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = БалансВедетсяПоПодразделениям(Дата);
	
	// подготовим таблицу для накопления сумм суммовых разниц по подразделениям
	ТаблицаСуммовыхРазниц = Новый ТаблицаЗначений();
	ТаблицаСуммовыхРазниц.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаСуммовыхРазниц.Колонки.Добавить("Сумма",         Новый ОписаниеТипов("Число"));
	
	//возврат
	ТаблицаВозвратов = Возвраты.Выгрузить();
	ТаблицаВозвратов.Свернуть("ДокументПродажи", "СуммаВсего,Вознаграждение");
	Для Каждого СтрокаВзаиморасчетов Из ТаблицаВозвратов Цикл
		НаборЗаписейВзаиморасчеты = Движения.ВзаиморасчетыКомпании;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц	= 0;
		НаборЗаписейВзаиморасчеты.ДокументОбъект					= ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.РежимПроведения					= РежимПроведения;
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписейВзаиморасчеты.Контрагент						= Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов				= ДоговорВзаиморасчетов;
		НаборЗаписейВзаиморасчеты.Сделка							= СтрокаВзаиморасчетов.ДокументПродажи;
		НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок				= ДоговорВзаиморасчетов.АвтоЗакрытиеСделок;
		НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем			= Ложь;
		НаборЗаписейВзаиморасчеты.Сумма								= -(СтрокаВзаиморасчетов.СуммаВсего - СтрокаВзаиморасчетов.Вознаграждение);
		
		// Доходы и расходы по суммовым разницам.
		СтрокаСуммовыхРазниц = ТаблицаСуммовыхРазниц.Добавить();
		СтрокаСуммовыхРазниц.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
		СтрокаСуммовыхРазниц.Сумма         = НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		УстановитьПривилегированныйРежим(Ложь);
		
		Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
	КонецЦикла;
	
	НаборЗаписейВзаиморасчеты = Движения.ВзаиморасчетыКомпании;
	НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц	= 0;
	НаборЗаписейВзаиморасчеты.ДокументОбъект					= ЭтотОбъект;
	НаборЗаписейВзаиморасчеты.РежимПроведения					= РежимПроведения;
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписейВзаиморасчеты.Контрагент						= Контрагент;
	НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов				= ДоговорВзаиморасчетов;
	НаборЗаписейВзаиморасчеты.Сделка							= Неопределено;
	НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок				= ДоговорВзаиморасчетов.АвтоЗакрытиеСделок;
	НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем			= Истина;
	НаборЗаписейВзаиморасчеты.Сумма								= Товары.Итог("СуммаВсего") - Товары.Итог("Вознаграждение");
		
	// Доходы и расходы по суммовым разницам.
	СтрокаСуммовыхРазниц = ТаблицаСуммовыхРазниц.Добавить();
	СтрокаСуммовыхРазниц.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
	СтрокаСуммовыхРазниц.Сумма         = НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
	УстановитьПривилегированныйРежим(Ложь);
		
	Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
	
	// доходы и расходы по суммовым разницам
	ТаблицаСуммовыхРазниц.Свернуть("Подразделение","Сумма");
	Для Каждого СтрокаСуммовыхРазниц Из ТаблицаСуммовыхРазниц Цикл
		Если СтрокаСуммовыхРазниц.Сумма<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение = СтрокаСуммовыхРазниц.Подразделение;
			КонецЕсли;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			Если СтрокаСуммовыхРазниц.Сумма<0 Тогда
				НаборЗаписейДиР.Расход = -СтрокаСуммовыхРазниц.Сумма;
			Иначе
				НаборЗаписейДиР.Доход = СтрокаСуммовыхРазниц.Сумма;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЦикла;		
	       	
	// партии
	Отказ=НЕ ПровестиПоПартиям(РежимПроведения,Ссылка) ИЛИ Отказ;
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	// двигаем границу последовательности взаиморасчетов
	РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
